DROP SCHEMA IF EXISTS kharidyar;

CREATE SCHEMA kharidyar;

USE kharidyar;

CREATE TABLE users (
    customer_id BIGINT PRIMARY KEY AUTO_INCREMENT,
    name VARCHAR(255),
    email VARCHAR(255),
    phone VARCHAR(11),
    password VARCHAR(255)
);

CREATE TABLE orders (
    order_id BIGINT PRIMARY KEY AUTO_INCREMENT,
    customer_id BIGINT,
    total_price DECIMAL(10, 2),
    status ENUM ('progress', 'delivered', 'completed', 'returned'),
    updated_time TIMESTAMP DEFAULT current_timestamp,
    FOREIGN KEY (customer_id) REFERENCES users (customer_id)
);

CREATE TABLE products (
    product_id BIGINT PRIMARY KEY AUTO_INCREMENT,
    name VARCHAR(255),
    price DECIMAL(10, 2)
);

CREATE TABLE product_unit (
    product_id BIGINT PRIMARY KEY,
    unit VARCHAR(255),
    FOREIGN KEY (product_id)
        REFERENCES products(product_id)
);

CREATE TABLE order_products (
    order_id BIGINT,
    product_id BIGINT,
    amount FLOAT,
    FOREIGN KEY (order_id) REFERENCES orders(order_id),
    FOREIGN KEY (product_id) REFERENCES products(product_id)
);

CREATE TABLE products_description (
    product_id BIGINT,
    description varchar(512),
    FOREIGN KEY (product_id) REFERENCES products (product_id)
);

-- CREATE TABLE chat_history (
--     chat_id BIGINT,
--     user_id BIGINT,
--     author ENUM('human', 'ai'),
--     request_text TEXT,
--     request_timestamp TIMESTAMP DEFAULT current_timestamp,
--     response_text TEXT,
--     response_timestamp TIMESTAMP DEFAULT current_timestamp,
--     metadata JSON,
--     FOREIGN KEY (user_id) REFERENCES users (customer_id)
-- );

CREATE TABLE chat_history (
    chat_id BIGINT,
    user_id BIGINT,
    author ENUM('human', 'ai'),
    input_text TEXT,
    input_timestamp TIMESTAMP DEFAULT current_timestamp,
    metadata JSON DEFAULT NULL,
    FOREIGN KEY (user_id) REFERENCES users (customer_id)
);


CREATE TABLE inventory (
    product_id BIGINT,
    count FLOAT,
    FOREIGN KEY (product_id) REFERENCES products(product_id)
);

CREATE TABLE report (
    user_id BIGINT,
    order_id BIGINT,
    report TEXT,
    FOREIGN KEY (user_id) REFERENCES users (customer_id),
    FOREIGN KEY (order_id) REFERENCES orders (order_id)
);

DROP TRIGGER IF EXISTS inventory_check;

CREATE TRIGGER inventory_check
BEFORE UPDATE ON inventory
FOR EACH ROW
BEGIN
    IF NEW.count < 0
        THEN
        SIGNAL SQLSTATE '45000' SET MESSAGE_TEXT = 'Quantity is not enough';
    END IF;
END;

DROP PROCEDURE IF EXISTS delete_products_for_order;

DELIMITER $$

CREATE PROCEDURE delete_products_for_order(IN order_id BIGINT)
BEGIN
    DECLARE product BIGINT;
    DECLARE amount FLOAT;
    DECLARE done BOOL DEFAULT FALSE;

    DECLARE my_cursor CURSOR FOR (
        SELECT op.product_id, op.amount
        FROM order_products op
        WHERE op.order_id = order_id
    );

    DECLARE CONTINUE HANDLER FOR NOT FOUND SET done = TRUE;

    START TRANSACTION ;

    OPEN my_cursor;
    my_loop: LOOP
        FETCH my_cursor INTO product, amount;

        IF done THEN
            LEAVE my_loop;
        END IF;

        UPDATE inventory i
        SET i.count = i.count + amount
        WHERE i.product_id = product;

    END LOOP;

    CLOSE my_cursor;

    DELETE FROM order_products o
    WHERE o.order_id = order_id;

    COMMIT ;
END $$

DELIMITER ;

CALL delete_products_for_order(8);

DROP TEMPORARY TABLE IF EXISTS temp;

CREATE TEMPORARY TABLE temp (
    t_product INT,
    t_amount FLOAT
);


# --- Insert --- #

INSERT INTO users (name, email, phone)
VALUES ('ali', 'ali@gmail.com', '09123456789'),
       ('sara', 'sara@gmail.com', '09129876543'),
       ('maryam', 'maryam@gmail.com', '09369026286'),
       ('zahra', 'zahra@gmail.com', '09362789015');



INSERT INTO products (product_id, price, name)
VALUES  (1, 30000.00, 'سیب'),
        (2, 42000.00, 'پرتقال'),
        (3, 25000.00, 'شیر'),
        (4, 5000.00, 'نان'),
        (5, 5500.00, 'تخم مرغ'),
        (6, 33000.00, 'پنیر'),
        (7, 90000.00, 'مرغ'),
        (8, 650000.00, 'گوشت'),
        (9, 390000.00, 'ماهی'),
        (10, 110000.00, 'برنج'),
        (11, 55000.00, 'پاستا'),
        (12, 26000.00, 'کاهو'),
        (13, 29000.00, 'سیب زمینی'),
        (14, 21000.00, 'خیار'),
        (15, 20000.00, 'هویج'),
        (16, 18000.00, 'گوجه فرنگی'),
        (17, 24000.00, 'پیاز'),
        (18, 13000.00, 'سیر'),
        (19, 580000.00, 'روغن زیتون'),
        (20, 41000.00, 'کره'),
        (21, 36000.00, 'آبمیوه'),
        (22, 30000.00, 'دلستر'),
        (23, 42000.00, 'تن ماهی'),
        (24, 25000.00, 'کیک وانیلی');

INSERT INTO inventory (product_id, count)
VALUES  (1, 10),
        (2, 20),
        (3, 5),
        (4, 7),
        (5, 2),
        (6, 1),
        (7, 9),
        (8, 5),
        (9, 4),
        (10, 6),
        (11, 14),
        (12, 30),
        (13, 5),
        (14, 7),
        (15, 9),
        (16, 1),
        (17, 23),
        (18, 8),
        (19, 32),
        (20, 5),
        (21, 7),
        (22, 3),
        (23, 11),
        (24, 3);

INSERT INTO product_unit
VALUES (1, 'کیلو|کیلوگرم|گرم'),
       (2, 'کیلو|کیلوگرم|گرم'),
       (3, 'بسته|بطری|عدد|تا|دونه|دانه'),
       (4, 'عدد|دونه|دانه|تا'),
       (5, 'عدد|تا|شونه'),
       (6, 'عدد|بسته|کیلو|کیلوگرم|گرم'),
       (7, 'دونه|عدد|تا|کیلو'),
       (8, 'دونه|عدد|تا|کیلو|شقه'),
       (9, 'دونه|عدد|تا|کیلو'),
       (10, 'بسته|کیلو|کیلوگرم|گرم|گونی'),
       (11, 'بسته|عدد|دونه|تا'),
       (12, 'دونه|کیلو|کیلوگرم|گرم'),
       (13, 'گونی|کیلو|کیلوگرم|گرم'),
       (14, 'کیلو|کیلوگرم|گرم'),
       (15, 'کیلو|کیلوگرم|گرم'),
       (16, 'کیلو|کیلوگرم|گرم'),
       (17, 'کیلو|کیلوگرم|گرم'),
       (18, 'کیلو|کیلوگرم|گرم|حبه'),
       (19, 'عدد|بطری|شیشه|دونه|دانه|تا'),
       (20, 'بسته|قالب|دونه|تا|دانه'),
       (21, 'بطری|شیشه|دونه|دانه|بسته'),
       (22, 'بطری|شیشه|دونه|دانه|بسته|تا'),
       (23, 'دونه|دانه|تا'),
       (24, 'دونه|دانه|تا|قالب');

-- INSERT INTO chat_history(chat_id, user_id, request_text, request_timestamp, response_text, response_timestamp)
-- VALUES (
--     11,
--     1,
--     "سلام خوبی برام دو تا دلستر بفرست عشق کنیما",
--     STR_TO_DATE('2012-01-02 12:01:12', '%Y-%m-%d %H:%i:%S'),
--     "حله چشاته بلا می فرستم برات آدرس بگو فقط",
--     STR_TO_DATE('2012-01-02 12:01:20', '%Y-%m-%d %H:%i:%S')
-- )

INSERT INTO products_description (product_id, description)
VALUES (1, 'در این فروشگاه ما سیب‌های خود را از بهترین باغ‌ها واقع در دماوند، تهیه می‌کنیم. همچنین این محصول به صورت ارگانیک و بدون استفاده از هرگونه مواد سم‌زدایی تهیه می‌شود. برای سفارش این محصول می‌توانید از بخش فروشگاه در سایت و یا به کمک چت‌بات خریدیار سفارش خود را انجام دهید.'),
       (2, 'این میوه که از دسته‌ی مرکبات محسوب می‌شود، در بهترین باغات استان مازندران و گیلان که هر دو از استان‌های حاصل خیز کشور برای کشت مرکبات هستند، پرورش داده می‌شودو فروشگاه ما نیز این میوه‌ها را از بهترین باغداران منطقه شمالی کشور تهیه می‌کند. خوردن این میوه در فصول سرد سال برای جلوگیری از مریضی بسیار مفید می‌باشد. شما نیز برای سلامتی خود می‌توانید این میوه را با بهترین کیفیت ممکن خریداری کنید. همچنین فروشگاه ما تضمین می‌کند که میوه‌ها با بهترین کیفیت به دست مشتری برسد.'),
       (3, 'در فروشگاه ما می توانید شیر خوراکی با انواع طعم دهنده‌ها مانند کاکائو و قهوه و نارگیل خریداری کنید. تضمین می‌شود که شیرهای ارسالی دارای تاریخ انقضا مناسب باشند و حداکثر 2 روز از تولید آنها گذشته باشد. همچنین در هنگام سفارش می‌توانید ذکر کنید که آیا می‌خواهید شیر ارسالی محلی باشد یا خیر. خوردن یک لیوان شیر در روز به خاطر کلسیم بالا توصیه می‌شود.'),
       (4, 'نان یکی از مواد غذایی مهم در سبد غذایی هر خانوار می‌باشد که بخش بسیار زیادی از آن از نشاسته تشکیل شده است. شما نیز می‌توانید برای اطمینان از کیفیت و پخت مناسب نان، این ماده غذایی را از فروشگاه ما خریداری کنید.'),
       (5, 'این خوراکی به عنوان یکی از مقوی‌ترین وعده‌های غذایی، سرشار از پروتئین و ویتامین می‌باشد. از این رو برای صبحانه یک ماده غذایی مهم محسوب می‌شود. شما نیز می‌توانید برای وعده‌های غذایی خود، می‌توانید تخم مرغ شفارش داده و یک روز عالی و پر انرژی را برای خود رقم بزنید.'),
       (6, 'یکی از پراستفاده‌ترین مواد غذایی در وعده صبحانه می‌باشد. پنیر به خاطر این که سرشار از کلسیم می‌باشد برای جلوگیری از پوکی استخوان مناسب می‌باشد. اگرچه که باید مراقب مصرف آن باشید و حتما با خوراکی‌هایی مانند گردو آن را مصرف کنید.'),
       (7, 'از گوشت مرغ و همین طور تخم آن، در بسیاری از وعده‌های غذایی ما انسان‌ها استفاده می‌شود. در فروشگاه ما تضمین می‌شود که مرغ‌های ارسالی به صورت ارگانیک بوده و در یک محیط سالم پرورش یافته‌اند.'),
       (8, 'مصرف گوشت انواع حیوانات، از قدیم رایج بوده و در حال حاضر نیز یکی از مواد غذایی مهم در هرم غذایی می‌باشد. در این فروشگاه ما گوشت حیوانات مختلفی را می‌فروشیم و همچنین تمام آنها حلال گوشت هستند و تازه بودن گوشت که یکی از مهم‌ترین فاکتورهای مشتریان برای سنجش کیفیت گوشت می‌باشد نیز تضمین شده و تمام گوشت‌های ارسالی به گوشت روز هستند.'),
       (9, 'ماهی سرشار از امگا3 می‌باشد و گوشتی لذیذ دارد. از آنجا که این ماده غذایی یکی از مهم‌ترین منابع ویتامین دی محسوب می‌شود خوردن آن به اندازه 1 بار در ماه توصیه می‌شود. ماهی‌های ارسالی ابتدا کاملا تمیز شده و همچنین صید روز می‌باشند و ماهی یخ زده در این فروسگاه نداریم. اگر از کیفیت ماهی ارسالی به هر دلیلی راضی نیستید می‌توانید به راحتی با پشتیبانی تماس بگیرید و مشکلات خود را حل کنید.'),
       (10, 'مهمترین قوت غالب مردمان دنیا برنج می باشد. این ماده غذایی سرشار از نشاسته می‌باشد که به همین دلیل باعث میشود کالری نسبتا بالایی داشته باشد و به همین دلیل باید در مصرف آن احتیاط کرد. در فروشگاه ما تمام برنج ها از بهترین مزارع حاصل خیز ناحیه شمالی کشور تهیه و بسته بندی می شود. بنابراین به راحتی و با اطمینان کامل می توانید برنج مورد نیاز خود را با بهترین کیفیت از فروشگاه ما بخرید.'),
       (11, 'پاستا غذایی پر انرژی و سرشار از نشاسته می باشد. این غذا که اصالتی ایتالیایی دارد در ایران با انواع و اقسام افزودنی های خوشمزه سرو می شود که طعم لذیذی به آن می دهد. شما نیز می توانید از فروشگاه خریدیار انواع ماکارانی را در طرح های مختلف را سفارش دهید و از خوردن آن لذت ببرید.'),
       (12, 'کاهو یک سبزی است که به طور گسترده در انواع سالادها استفاده می شود. همین طور کاهو منبع سرشاری از ویتامین های  A و K می باشد. این سبزی کالری کمی دارد و برای رژیم غذایی مناسب می باشد. همچنین این سبزی به هضم غذا و سلامت دستگاه گوارش کمک می کند.'),
       (13, 'یکی از مهم ترین محصولات محصولات کشاورزی جهان می باشد که منبع غنی از کربوهیدرات می باشد. از آنجایی که این ماده غذایی سرشار از فیبر می باشد به بهبود هضم غذا کمک می کند. سیب زمین های فروشگاه ما از اراضی حومه همدان و اردبیل که بهترین شرایط کشت سیب زمینی را دارند می باشد.'),
       (14, 'خیار یکی از سبزیجات خنک و تازه است که طعم خوشایندی دارد. این محصول غنی از ویتامین‌ها و مواد معدنی است و می‌تواند به تقویت سیستم ایمنی بدن کمک کند. خیارهای ما از باغ‌های خردادگرم در استان گیلان برداشت می‌شوند. این خیارها با آب و هوای معتدل و خاک حاصلخیز این منطقه، طعمی خنک و تازه دارند که نمی‌توانید آن را فراموش کنید.'),
       (15, 'هویج با رنگ زرد نارنجی خود، منبع غنی از بتاکاروتن است. این محصول خوشمزه و مغذی می‌تواند به بهبود بینایی کمک کند و پوست شما را سالم نگه دارد. هویج‌های ما از باغ‌های زیر آفتاب استان کرمان برداشت می‌شوند که می توانید آنها را از بخش فروشگاه سفارش دهید.'),
       (16 , 'گوجه فرنگی یکی از پر کاربرد ترین گیاهانی است که در آشپزی و سالادها استفاده می شود. گوجه‌ فرنگی های ما از باغ‌های استان فارس برداشت می‌شوند. با رنگ‌های زیبای قرمز، بنفش و زرد، این گوجه‌ها طعم و عطر فوق‌العاده‌ای به غذاهای شما می‌دهند و گوجه به کاهش قند خون و کاهش خطر بیماری قلبی کمک می کند.'),
       (17, 'پیاز یکی از محصولات پایه در آشپزی است و می‌تواند طعم و عطر فوق‌العاده‌ای به غذاها ببخشد. این محصول غنی از ویتامین C و فیبر است و به سلامت قلب کمک می‌کند و همچنین به خاطر وجود انواع مواد معدنی، کمک شایانی به سیستم ایمنی بدن می کند. پیازهای ما از باغ‌های استان همدان برداشت می‌شوند. این پیازها با خاک حاصلخیز و آب و هوای سرد این منطقه، طعم و عطر فوق‌العاده‌ای دارند.'),
       (18, 'سیر یکی از گیاهان دارویی با قدمت طولانی است که در سراسر جهان به عنوان یک ماده غذایی و دارو شناخته شده است. این گیاه دارای خواص بهداشتی فراوانی است و مصرف مناسب آن می‌تواند به بهبود سلامتی کمک کند. سیرهای فروشگاه ما از استان همدان که آب و هوای بسیار مناسبی برای کشت این ماده غذایی دارند، تهیه می شود.'),
       (19, 'روغن زیتون یکی از محصولات گیاهی مهم است که ازمیوه‌های زیتون به دست می‌آید. این روغن دارای خواص بسیاری است که برای سلامتی مفید می‌باشد. برای مثال به خاطر داشتن اسیدهای چرب غیر اشباع، به کاهش خطر بیماری قلبی کمک می کند و برای سلامت پوست و مو مهم است. شما نیز می توانید این روغن را که از بهترین برندهای بازار برای فروش استفاده می شوند را برای خود سفارش داده و در کنار سالاد و یا دیگر غذاها آن را مصرف کنید.'),
       (20, 'کره که یکی از مواد غذایی پر کاربرد در پخت بعضی غذاها و بسیاری از کیک ها و همچنین وعده صبحانه می باشد، دارای دو نوع گیاهی و حیوانی می باشد. کره های ما از شیر تازه گاوهایی که در مراتع سرسبز استان مازندران چرا می‌کنند، تهیه می‌شود. این کره با طعم خوشایند و مغذی خود، منبع عالی از ویتامین A و اسیدهای چرب ضروری است که به سلامت پوست و مو کمک می‌کند.'),
       (21, 'آبمیوه‌های ما از میوه‌های تازه و طبیعی تهیه می‌شوند و همچنین این آبمیوه‌ها غنی از ویتامین‌ها و آنتی‌اکسیدان‌ها هستند و می‌توانند به تقویت سیستم ایمنی بدن و حفظ سلامت کلی بدن کمک کنند.'),
       (22, 'دلستر یک نوشیدنی غیرالکلی می‌باشد که طعم‌های متفاوتی دارد و شما می‌توانید به راحتی این محصول را از فروشگاه ما سفارش بدهید. پیشنهاد می‌شود در خوردن مایعاتی از قبیل دلستر را بیش از حد مصرف نکنید، چرا که می‌تواند باعث پوسیدگی دندان و مشکلات گوارشی بشود اما در هر صورت این نوشیدنی خوشمزه اگر متعادل مصرف بشود، مفید خواهد بود.'),
       (23, 'کنسروهای تن‌ماهی فروشگاه ما از بهترین برندهای بازار مانند شیلتون، طبیعت، شیلانه می‌باشد. این غذا حاوی مقدار زیادی مواد مغذی و پروتئین می‌باشد. مصرف زیاد غذاهای کنسروی به مدت طولانی، خطراتی از جمله بیماری‌های قلبی عروقی را به همراه دارد؛ بنابر این به حفظ سلامی خود بیاندیشید.'),
       (24, 'کیک‌های موجود در فروشگاه ما توسط بهترین قنادی‌های تهران پخته می‌شوند و همچنین تضمین می‌کنیم که کیک‌ها سالم و تازه به دست مشتری برسند. در تهیه کیک‌ها از مرغوب‌ترین مواد استفاده خواهد شد. در صورتی که هر گونه مشکلی در خرید کیک از فروشگاه ما داشته باشید، می‌توانید به راحتی گزارش خود را به تیم پشتیبانی تحویل دهید و کیک خود را مرجوع کنید.');

INSERT INTO orders (customer_id, total_price, status)
VALUES  (1, 200000, 'progress'),
        (1, 30000, 'delivered'),
        (2, 30000, 'progress');

INSERT INTO orders
VALUES (10, 1, 1, 'progress', '2024-02-02 16:14:18');

INSERT INTO order_products
VALUES  (1, 1, 3),
    (1, 5, 2),
    (1, 7, 5),
    (2, 1, 4),
    (2, 1, 10),
    (3, 8, 1),
    (3, 10, 3),
    (3, 9, 5),
    (10, 1, 10),
    (10, 1, 10);

# --- test --- #

-- INSERT INTO chat_history(chat_id, user_id, author, input_text, input_timestamp) 
-- VALUES (            
--     1,            
--     1,            
--     "human",            
--     "سلام",            
--     STR_TO_DATE("2024-06-22 08:33:13", "%Y-%m-%d %H:%i:%S")
-- );
